Enums/бит_ТипыВариантовОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ТипыВариантовОтчетов</Name>
			<Comment>Типы вариантов отчетов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Предопределенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пользовательский</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Внешний</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/бит_ВариантыОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_ВариантыОтчетов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипВарианта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипыВариантовОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПриОткрытии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючВарианта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеВарианта</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

SettingsStorages/бит_ХранилищеВариантовОтчетов/Forms/ФормаСохраненияУправляемая/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Перем КлючТекущихНастроек;
	
	КлючОбъекта = Параметры.КлючОбъекта;
	КлючТекущихНастроек = Параметры.КлючТекущихНастроек;
	
	ОбновитьТаблицуВариантов();
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьДекорациюВарианта();
	
	Доступен = "2";
	Элементы.Автор.Доступность = Ложь;
	
КонецПроцедуры // ПриОткрытии()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НаименованиеВариантаОчистка(Элемент, СтандартнаяОбработка)
	
	ОчиститьТекущийВариант();
	
КонецПроцедуры // НаименованиеВариантаОчистка()

&НаКлиенте
Процедура НаименованиеВариантаПриИзменении(Элемент)
	
	СтрокаДоступна = Истина;
	
	Если ПустаяСтрока(НаименованиеВарианта) Тогда
		
		ОчиститьТекущийВариант();
		
	Иначе
		
		НайденнаяСтрока = НайтиСтрокуСохраненногоВариантаВТаблице();
		
		Если НайденнаяСтрока = Неопределено Тогда
			ОчиститьТекущийВариант(Не СтрокаДоступна);  
		Иначе    
			СохраненныйВариант = НайденнаяСтрока.СохраненныйВариант;
		КонецЕсли; 
		
	КонецЕсли; 
	
	УстановитьДекорациюВарианта();
	
КонецПроцедуры // НаименованиеВариантаПриИзменении()

&НаКлиенте
Процедура ДоступенПриИзменении(Элемент)
	
	Элементы.Автор.Доступность = (Доступен = "1");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСохраненныеВарианты

&НаКлиенте
Процедура ТаблицаСохраненныеВариантыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ТаблицаСохраненныеВарианты.ТекущиеДанные;
	Если ТекущиеДанные.ЭтоПредопределенный Тогда
		
		ТекстСообщения = Нстр("ru = 'Нельзя выбрать предопределенный элемент.'");
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения);
		
		СтандартнаяОбработка = Ложь;
		Возврат;
		
	КонецЕсли;
	
	НаименованиеВарианта    = ТекущиеДанные.СохраненныйВариант;
	ИспользоватьПриОткрытии = ТекущиеДанные.ИспользоватьПриОткрытии;
	СохраненныйВариант      = ТекущиеДанные.СохраненныйВариант;
	
	УстановитьДекорациюВарианта();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОбновить(Команда)
	
	ОбновитьТаблицуВариантов();
	
КонецПроцедуры // КомандаОбновить()

&НаКлиенте
Процедура КомандаИспользоватьПриОткрытии(Команда)
	
	ТекущиеДанные = Элементы.ТаблицаСохраненныеВарианты.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		ИзменитьИспользоватьПриОткрытии(ТекущиеДанные.ПолучитьИдентификатор());
		
	КонецЕсли; 
	
КонецПроцедуры // КомандаИспользоватьПриОткрытии()

&НаКлиенте
Процедура СохранитьВариант(Команда)
	
	Если ПустаяСтрока(НаименованиеВарианта) Тогда
		
		ТекстСообщения = НСтр("ru = 'Не указано наименование сохраняемого варианта!'");
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения,, "НаименованиеВарианта");
		Возврат;
		
	КонецЕсли; 
	
	СтруктураРезультата = СоздатьОбновитьВариант();
	РезВариант = СтруктураРезультата.РезВариант;
	
	Если ЗначениеЗаполнено(РезВариант) Тогда
		
		КлючТекВарианта = СтруктураРезультата.КлючВарианта;
		ВыборНастроек = Новый ВыборНастроек(КлючТекВарианта);
		
		Закрыть(ВыборНастроек);		
		
	ИначеЕсли Не СтруктураРезультата.ИзменениеДоступно Тогда
		
		ТекстСообщения = Нстр("ru = 'Недостаточно прав для изменения варианта.'");
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения);
		
	Иначе
		
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры // СохранитьВариант()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// Клиент

//  Процедура выполняет очистку текущего варианта.
//
&НаКлиенте
Процедура ОчиститьТекущийВариант(ОчищатьНаименование = Истина)
	
	СохраненныйВариант = Неопределено;
	ИспользоватьПриОткрытии = Ложь;
	
	Если ОчищатьНаименование Тогда
		
		НаименованиеВарианта = "";
		
	КонецЕсли; 
	
	УстановитьДекорациюВарианта(); 	 
	
КонецПроцедуры // ОчиститьТекущийВариант()

//  Процедура выводит информацию редактируется существующий вариант или создается новый.
//
&НаКлиенте
Процедура УстановитьДекорациюВарианта()
	
	Если ЗначениеЗаполнено(СохраненныйВариант) Тогда
		ТекстВариантаСтарыйНовый = "Существующий вариант";
	Иначе	
		ТекстВариантаСтарыйНовый = "Новый вариант";
	КонецЕсли; 
	
КонецПроцедуры // УстановитьДекорациюВарианта()

////////////////////////////////////////////////////////////////////////////////
// Сервер

//  Функция Обновляет существующую либо создает новый вариант.
//
// Возвращаемое значение:
//   РезВариант   - СправочникСсылка.бит_ВариантыОтчетов.
//
&НаСервере
Функция СоздатьОбновитьВариант()
	
	СтруктураРезультата = Новый Структура;
	ИзменениеДоступно   = Истина;
	РезВариант          = Неопределено;
	
	Если ЗначениеЗаполнено(СохраненныйВариант) Тогда
		РезВариант = ОбновитьВариант();
	Иначе
		РезВариант = СоздатьВариант();
	КонецЕсли; 
	
	КлючВарианта = ?(ЗначениеЗаполнено(РезВариант), РезВариант.КлючВарианта, Неопределено);
	
	СтруктураРезультата.Вставить("РезВариант"       , РезВариант);
	СтруктураРезультата.Вставить("ИзменениеДоступно", ИзменениеДоступно);
	СтруктураРезультата.Вставить("КлючВарианта"     , КлючВарианта);
	
	Возврат СтруктураРезультата;
	
КонецФункции // СоздатьОбновитьВариант()

//  Функция обновляет существующий вариант.
//
// Возвращаемое значение:
//   РезВариант   - СправочникСсылка.бит_ВариантыОтчетов.
//
&НаСервере
Функция ОбновитьВариант()
	
	УстановитьПривилегированныйРежим(Истина);
	
	СпрОб = СохраненныйВариант.ПолучитьОбъект();
	СпрОб.Наименование            = НаименованиеВарианта;
	СпрОб.ИспользоватьПриОткрытии = ИспользоватьПриОткрытии;
	
	флДействиеВыполнено = бит_ОбщегоНазначения.ЗаписатьСправочник(СпрОб,,"Ошибки");
	
	Если флДействиеВыполнено Тогда
		РезВариант = СпрОб.Ссылка;
		Если ИспользоватьПриОткрытии Тогда
			
			Справочники.бит_ВариантыОтчетов.СброситьИспользоватьПриОткрытии(СпрОб.Ссылка);
			
		КонецЕсли; 
	Иначе	
		РезВариант = Справочники.бит_ВариантыОтчетов.ПустаяСсылка();
	КонецЕсли; 
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат РезВариант;
	
КонецФункции // ОбновитьВариант()

//  Функция создает новый вариант.
//
// Возвращаемое значение:
//   РезВариант   - СправочникСсылка.бит_ВариантыОтчетов.
//
&НаСервере
Функция СоздатьВариант()
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Наименование"	  		  , НаименованиеВарианта);
	СтруктураПараметров.Вставить("КлючОбъекта"		      , КлючОбъекта);
	
	// БИТ_ЖКХ 21.01.2015{{
	Если НЕ Доступен = "1" Тогда
		СтруктураПараметров.Вставить("Ответственный"	      , ПредопределенноеЗначение("Справочник.ГруппыПользователей.ВсеПользователи"));
	Иначе
		
		Если ЗначениеЗаполнено(Автор) Тогда
			
			СтруктураПараметров.Вставить("Ответственный"	      , Автор);
			
		Иначе	
			
			СтруктураПараметров.Вставить("Ответственный"	      , бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
			
		КонецЕсли;
		
	КонецЕсли;
	// БИТ_ЖКХ 21.01.2015}}
	
	СтруктураПараметров.Вставить("ИспользоватьПриОткрытии", ИспользоватьПриОткрытии);
	СтруктураПараметров.Вставить("ТипВарианта"			  , Перечисления.бит_ТипыВариантовОтчетов.Пользовательский);
	
	РезВариант = Справочники.бит_ВариантыОтчетов.СоздатьВариант(СтруктураПараметров);
	
	СохраненныйВариант = РезВариант;
	
	Возврат РезВариант;
	
КонецФункции // СоздатьВариант()

//  Процедура обновляет таблицу сохраненных вариантов.
//
&НаСервере
Процедура ОбновитьТаблицуВариантов()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КлючОбъекта", КлючОбъекта);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	бит_ВариантыОтчетов.Ссылка,
	|	бит_ВариантыОтчетов.Наименование,
	|	бит_ВариантыОтчетов.ИспользоватьПриОткрытии,
	|	бит_ВариантыОтчетов.Ответственный,
	|	бит_ВариантыОтчетов.КлючВарианта,
	|	бит_ВариантыОтчетов.ТипВарианта
	|ИЗ
	|	Справочник.бит_ВариантыОтчетов КАК бит_ВариантыОтчетов
	|ГДЕ
	|	бит_ВариантыОтчетов.КлючОбъекта = &КлючОбъекта
	|
	|УПОРЯДОЧИТЬ ПО
	|	бит_ВариантыОтчетов.Наименование
	|АВТОУПОРЯДОЧИВАНИЕ
	|";
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	ТаблицаСохраненныеВарианты.Очистить();
	
	// Пользовательские варианты
	Пока Выборка.Следующий() Цикл
		
		// БИТ_ЖКХ 21.01.2015{{
		Если Выборка.Ответственный = ПредопределенноеЗначение("Справочник.ГруппыПользователей.ВсеПользователи") 
			или	Выборка.Ответственный = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь") Тогда
			
			НоваяСтрока = ТаблицаСохраненныеВарианты.Добавить();
			НоваяСтрока.СохраненныйВариант 		= Выборка.Ссылка;
			НоваяСтрока.Ответственный 			= Выборка.Ответственный;
			НоваяСтрока.ИспользоватьПриОткрытии = Выборка.ИспользоватьПриОткрытии;
			Если Выборка.ТипВарианта = Перечисления.бит_ТипыВариантовОтчетов.Предопределенный Тогда
				НоваяСтрока.ЭтоПредопределенный 	  = Истина; 		
			КонецЕсли;
			
		КонецЕсли;
		// БИТ_ЖКХ 21.01.2015}}
		
	КонецЦикла; 
	
КонецПроцедуры // ОбновитьТаблицуВариантов()

//  Процедура изменяен флаг ИспользоватьПриОткрытии на противоположный 
// для строки сохраненных вариантов.
//
// Параметры:
//  ИдСтроки  - Строка
//
&НаСервере
Процедура ИзменитьИспользоватьПриОткрытии(ИдСтроки)
	
	ТекущиеДанные = ТаблицаСохраненныеВарианты.НайтиПоИдентификатору(ИдСтроки);
	
	Если НЕ ТекущиеДанные = Неопределено Тогда
		
		Справочники.бит_ВариантыОтчетов.ИзменитьИспользоватьПриОткрытии(ТекущиеДанные.СохраненныйВариант, НЕ ТекущиеДанные.ИспользоватьПриОткрытии);
		ОбновитьТаблицуВариантов();
		
		Если ЗначениеЗаполнено(СохраненныйВариант) Тогда
			
			ИспользоватьПриОткрытии = СохраненныйВариант.ИспользоватьПриОткрытии;
			
		КонецЕсли;  		
		
	КонецЕсли; 
	
КонецПроцедуры // ИзменитьИспользоватьПриОткрытии()

//  Функция осуществляет поиск сохранённого варинта в таблице по наименованию
//
// Параметры:
//  Нет
//  
// Возвращаемое значение:
//   ДанныеФормыЭлементКоллекции
//
&НаСервере
Функция НайтиСтрокуСохраненногоВариантаВТаблице()
	
	НайденнаяСтрока = Неопределено;
	
	Для каждого СтрокаТаблицы Из ТаблицаСохраненныеВарианты Цикл
		
		Если Строка(СтрокаТаблицы.СохраненныйВариант.Наименование) = НаименованиеВарианта Тогда
			
			Если СтрокаТаблицы.ЭтоПредопределенный Тогда
				
				Продолжить;
				
			Иначе
				
				НайденнаяСтрока 		= СтрокаТаблицы;
				ИспользоватьПриОткрытии = СтрокаТаблицы.СохраненныйВариант.ИспользоватьПриОткрытии;
				Прервать;
				
			КонецЕсли;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	Возврат НайденнаяСтрока;
	
КонецФункции // НайтиСтрокуСохраненногоВариантаВТаблице()

#КонецОбласти
